Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РешенияКлиентовПоЗначениямЭСП</xr:Item>
				<xr:Item>InformationRegister.АналогиЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелиИспользованияАналогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиЦелейРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЦелейРасчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаОценочнойСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиРасчетПоПартиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаДляОстатковПартий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЦеныКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЦеныОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах/Forms/ФормаПодбораАналогов/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЭтаФорма.Параметры.Свойство("ПараметрыПодбора") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры.ПараметрыПодбора);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Организация) Тогда
		ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	ОбновитьМетодикуНаСервере();
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ЦеннаяБумага) И ЗначениеЗаполнено(ЭтотОбъект.Период) И ЗначениеЗаполнено(ЭтотОбъект.Методика) Тогда	
		ЗаполнитьАналоги();	
	КонецЕсли;
	
	ПересчитатьИтогиПоАналогам(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	Если ЭтаФорма.Параметры.ЗакрыватьПриВыборе = Неопределено Тогда
		Элементы.ВыполнитьВыбор.Видимость			= Ложь;
		Элементы.ЗаполнитьАналоги.КнопкаПоУмолчанию	= Истина;
	КонецЕсли;	
		
	Элементы.Организация.Видимость			= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.ОрганизацияНадпись.Видимость	= Не Элементы.Организация.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
	ОбновитьМетодикуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
	ОбновитьМетодикуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
	ОбновитьМетодикуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура МетодикаПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();
	
	ЗаполнитьПараметрыПоискаАналогичныхБумаг();	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПараметровПриИзменении(Элемент)
	
	Если Не ЭтаФорма.РедактированиеПараметров Тогда
		
		ПриИзмененииПараметровШапки();
		
		ЗаполнитьПараметрыПоискаАналогичныхБумаг();
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РейтинговыеАгентстваПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникТаблицыСоответствияРейтинговПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетРоссийскихАгентствПередИностраннымиПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РейтинговаяГруппаГосударственныхОблигацийПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПроверкиОбъемаСделокАналоговПриИзменении(Элемент)

	Если ЭтаФорма.ПараметрПоискаВариантПроверкиОбъемаСделокАналогов = "ПоМетодикеТранснефть2020"
		ИЛИ ЭтаФорма.ПараметрПоискаВариантПроверкиОбъемаСделокАналогов = "ПоМетодикеТранснефть2023"
	Тогда
		ЭтаФорма.ПараметрПоискаГлубинаПроверкиОбъемаСделок = 1;
	ИначеЕсли ЭтаФорма.ПараметрПоискаГлубинаПроверкиОбъемаСделок <> 10 Тогда
		ЭтаФорма.ПараметрПоискаГлубинаПроверкиОбъемаСделок = 10;
		Предупреждение("Глубина проверки объема сделок изменена на 10 торговых дней");
	КонецЕсли;
	
	ПриИзмененииПараметровШапки();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГлубинаПроверкиОбъемаСделокПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьНаличиеСделокНаДатуРасчетаПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантГруппировкиПоДюрацииПриИзменении(Элемент)
	
	Если ЭтаФорма.ПараметрПоискаВариантГруппировкиПоДюрации = "ПоОтклонению"
		И ЭтаФорма.ПараметрПоискаДопустимоеОтклонениеДюрации <> 30
	Тогда
		ЭтаФорма.ПараметрПоискаДопустимоеОтклонениеДюрации = 30;
		Предупреждение("Допустимое отклонение дюрации изменено на +/- 30 дней");
	КонецЕсли;
	
	ПриИзмененииПараметровШапки();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопустимоеОтклонениеДюрацииПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоОтраслямПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьДюрациюПриОтсутствииДанныхММВБПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.АналогиЗначение Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьЗначение(Элементы.Аналоги.ТекущиеДанные.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриИзменении(Элемент)

	ПересчитатьИтогиПоАналогам(ЭтаФорма);	
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаполнитьАналоги(Команда)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАналоги();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьВыбор(Команда)

	ОтмеченныеАналоги = Новый Массив;	
	
	Для Каждого Элемент Из ЭтаФорма.Аналоги Цикл
		Если Элемент.Пометка Тогда
			ОтмеченныеАналоги.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОповеститьОВыборе(ОтмеченныеАналоги);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_функции_и_процедуры

&НаКлиенте
Процедура ПриИзмененииПараметровШапки()
	
	ЭтаФорма.Аналоги.Очистить();
	ЭтаФорма.Расшифровка = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоискаАналогичныхБумаг()

	// Определяем параметры поиска, добавленные на форму, и очищаем их
	
	ПрефиксПараметраФормы	= "ПараметрПоиска";
	ПараметрыПоискаФормы	= Новый Структура;
	
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если СтрНачинаетсяС(РеквизитФормы.Имя, ПрефиксПараметраФормы) Тогда
			ПараметрыПоискаФормы.Вставить(РеквизитФормы.Имя);
		КонецЕсли;
	КонецЦикла;	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПоискаФормы);
	
	// Получаем параметры поиска по методике
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							ЭтаФорма.Организация);
	ПараметрыОценки.Вставить("Клиент",								ЭтаФорма.Клиент);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости", ЭтаФорма.Методика);
	
	ПараметрыПоиска = РаботаСПереоценкой.ПолучитьПараметрыПоискаАналогичныхБумаг(ПараметрыОценки, ЭтаФорма.Период);
	
	// Заполняем только те, что есть на форме
	
	ПолученныеПараметрыПоискаФормы = Новый Структура;
	
	Для Каждого ПараметрПоиска Из ПараметрыПоиска Цикл
	
		Если ПараметрПоиска.Ключ = "ПараметрыРасчетаРейтинга" Тогда
			
			Если ТипЗнч(ПараметрПоиска.Значение) = Тип("Структура") Тогда
				
				Для Каждого ПараметрРасчетаРейтинга Из ПараметрПоиска.Значение Цикл
					
					КлючПараметраПоиска = ПрефиксПараметраФормы + ПараметрПоиска.Ключ + ПараметрРасчетаРейтинга.Ключ;
					
					Если ПараметрыПоискаФормы.Свойство(КлючПараметраПоиска) Тогда
						ПолученныеПараметрыПоискаФормы.Вставить(КлючПараметраПоиска, ПараметрРасчетаРейтинга.Значение);
					КонецЕсли;
					
				КонецЦикла; 
			
			КонецЕсли;
			
		Иначе
			
			КлючПараметраПоиска = ПрефиксПараметраФормы + ПараметрПоиска.Ключ;
			
			Если ПараметрыПоискаФормы.Свойство(КлючПараметраПоиска) Тогда
				ПолученныеПараметрыПоискаФормы.Вставить(КлючПараметраПоиска, ПараметрПоиска.Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПолученныеПараметрыПоискаФормы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаРедактированиеПараметров.Доступность	= Форма.РедактированиеПараметров;
	Элементы.ГлубинаПроверкиОбъемаСделок.Доступность	= (Форма.ПараметрПоискаВариантПроверкиОбъемаСделокАналогов = "");
	Элементы.ДопустимоеОтклонениеДюрации.Доступность	= (Форма.ПараметрПоискаВариантГруппировкиПоДюрации = "ПоОтклонению");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМетодикуНаКлиенте()
	
	МетодикаОценкиОбъектовВУправлении = Неопределено;
	
	ОбновитьСписокВыбораМетодики(ЭтаФорма, МетодикаОценкиОбъектовВУправлении);	

	Если ЗаполнитьМетодику(ЭтаФорма, МетодикаОценкиОбъектовВУправлении) Тогда
		
		ЗаполнитьПараметрыПоискаАналогичныхБумаг();
		
		НастроитьВидимостьИДоступность(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМетодикуНаСервере()
	
	МетодикаОценкиОбъектовВУправлении = Неопределено;
	
	ОбновитьСписокВыбораМетодики(ЭтаФорма, МетодикаОценкиОбъектовВУправлении);	

	Если ЗаполнитьМетодику(ЭтаФорма, МетодикаОценкиОбъектовВУправлении) Тогда
		
		ЗаполнитьПараметрыПоискаАналогичныхБумаг();
		
		НастроитьВидимостьИДоступность(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьМетодику(ЭтаФорма, МетодикаОценкиОбъектовВУправлении)
	
	ОбновитьМетодику = Истина;
	
	#Если Клиент Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.Методика) И ЭтаФорма.Методика <> МетодикаОценкиОбъектовВУправлении
			ИЛИ ЭтаФорма.РедактированиеПараметров
		Тогда
			ОбновитьМетодику = (Вопрос("Обновить методику и параметры поиска?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);		
		КонецЕсли;
			
	#КонецЕсли
	
	Если ОбновитьМетодику Тогда
		
		Если ЗначениеЗаполнено(МетодикаОценкиОбъектовВУправлении) Тогда
			ЭтаФорма.Методика = МетодикаОценкиОбъектовВУправлении;
		ИначеЕсли ЭтаФорма.Элементы.Методика.СписокВыбора.Количество() = 1 Тогда
			ЭтаФорма.Методика = ЭтаФорма.Элементы.Методика.СписокВыбора.Получить(0).Значение;
		Иначе
			ЭтаФорма.Методика = Неопределено;
		КонецЕсли;
		
		ЭтаФорма.РедактированиеПараметров = Ложь;

	КонецЕсли;
	
	Возврат ОбновитьМетодику;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораМетодики(ЭтаФорма, МетодикаОценкиОбъектовВУправлении = Неопределено)
	
	СписокВыбораМетодики = ЭтаФорма.Элементы.Методика.СписокВыбора;
	СписокВыбораМетодики.Очистить();
	
	Если ЗначениеЗаполнено(ЭтаФорма.Клиент) И ЗначениеЗаполнено(ЭтаФорма.Организация) И ЗначениеЗаполнено(ЭтаФорма.Период) Тогда

		ИспользуемыеМетодики = ПолучитьИспользуемыеМетодики(ЭтаФорма.Клиент, ЭтаФорма.Организация, ЭтаФорма.Период, МетодикаОценкиОбъектовВУправлении);
		
		СписокВыбораМетодики.ЗагрузитьЗначения(ИспользуемыеМетодики);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИспользуемыеМетодики(Клиент, Организация, Период, МетодикаОценкиОбъектовВУправлении = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		
		СчетаКлиента = Новый ТаблицаЗначений;
		СчетаКлиента.Колонки.Добавить("Организация",					Новый ОписаниеТипов("СправочникСсылка.Организации"));
		СчетаКлиента.Колонки.Добавить("СчетДоверительногоУправления",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
		
		ЗаполнитьЗначенияСвойств(СчетаКлиента.Добавить(), Новый Структура("Организация, СчетДоверительногоУправления", Организация, Клиент));
		
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(СчетаКлиента, "_СчетаКлиента", Запрос);
		
	Иначе	
		
		РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Клиент, Организация, Период, Истина, "_СчетаКлиента", Запрос.МенеджерВременныхТаблиц);
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаКлиента.Организация КАК Организация,
		|	_СчетаКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЦелиРасчета.Ссылка КАК ЦельРасчета
		|ПОМЕСТИТЬ _ЦелиРасчетаКлиента
		|ИЗ
		|	_СчетаКлиента КАК _СчетаКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
		|				&Период,
		|				(Организация, СчетДоверительногоУправления) В
		|					(ВЫБРАТЬ
		|						_СчетаКлиента.Организация,
		|						_СчетаКлиента.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаКлиента КАК _СчетаКлиента)) КАК НастройкиУчетаОбщие
		|		ПО (НастройкиУчетаОбщие.СчетДоверительногоУправления = _СчетаКлиента.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦелиРасчета КАК ЦелиРасчета
		|		ПО (ЦелиРасчета.Ссылка = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|				ИЛИ НастройкиУчетаОбщие.ВестиНалоговыйУчет
		|					И ЦелиРасчета.Ссылка = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.НалоговыйУчет)
		|				ИЛИ НастройкиУчетаОбщие.ВестиБухгалтерскийУчет
		|					И ЦелиРасчета.Ссылка = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.БухгалтерскийУчет)
		|				ИЛИ НастройкиУчетаОбщие.ВестиЕдиныйБухгалтерскийУчет
		|					И ЦелиРасчета.Ссылка = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиЦелейРасчетаСрезПоследних.ВариантРасчетаОценочнойСтоимости КАК ВариантРасчетаОценочнойСтоимости,
		|	НастройкиЦелейРасчетаСрезПоследних.ЦельРасчета КАК ЦельРасчета
		|ПОМЕСТИТЬ _ИспользуемыеМетодики
		|ИЗ
		|	РегистрСведений.НастройкиЦелейРасчета.СрезПоследних(
		|			&Период,
		|			(Организация, СчетДоверительногоУправления, ЦельРасчета) В
		|				(ВЫБРАТЬ
		|					_ЦелиРасчетаКлиента.Организация,
		|					_ЦелиРасчетаКлиента.СчетДоверительногоУправления,
		|					_ЦелиРасчетаКлиента.ЦельРасчета
		|				ИЗ
		|					_ЦелиРасчетаКлиента КАК _ЦелиРасчетаКлиента)) КАК НастройкиЦелейРасчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ИспользуемыеМетодики.ВариантРасчетаОценочнойСтоимости КАК ВариантРасчетаОценочнойСтоимости
		|ПОМЕСТИТЬ _МетодикаОценкиОбъектовВУправлении
		|ИЗ
		|	_ИспользуемыеМетодики КАК _ИспользуемыеМетодики
		|ГДЕ
		|	_ИспользуемыеМетодики.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИспользуемыеМетодики.ВариантРасчетаОценочнойСтоимости КАК ВариантРасчетаОценочнойСтоимости
		|ИЗ
		|	_ИспользуемыеМетодики КАК _ИспользуемыеМетодики";
	
	ИспользуемыеМетодики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВариантРасчетаОценочнойСтоимости");
	
	ВыборкаМетодикиОценкиОбъектовВУправлении = Запрос.МенеджерВременныхТаблиц.Таблицы["_МетодикаОценкиОбъектовВУправлении"].ПолучитьДанные().Выбрать();
	Если ВыборкаМетодикиОценкиОбъектовВУправлении.Следующий() Тогда
		МетодикаОценкиОбъектовВУправлении = ВыборкаМетодикиОценкиОбъектовВУправлении.ВариантРасчетаОценочнойСтоимости;
	Иначе
		МетодикаОценкиОбъектовВУправлении = Неопределено;
	КонецЕсли;
	
	Возврат ИспользуемыеМетодики;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьИтогиПоАналогам(ЭтаФорма)
	
	// Отмеченные аналоги
	
	ОтмеченныеАналоги = Новый Массив;
	
	Для Каждого Элемент Из ЭтаФорма.Аналоги Цикл
		Если Элемент.Пометка Тогда
			ОтмеченныеАналоги.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ВыбраноАналогов = ОтмеченныеАналоги.Количество();
	
	// Зарегистрированные аналоги
	
	ЗарегистрированныеАналоги = ПолучитьДействующиеАналоги(ЭтаФорма.ЦеннаяБумага, ЭтаФорма.Клиент, ЭтаФорма.Организация, ЭтаФорма.Период);
		
	ЭтаФорма.ЗарегистрированоАналогов = ЗарегистрированныеАналоги.Количество();
	
	// Итого
	
	РаботаСКоллекциями.ДополнитьМассив(ОтмеченныеАналоги, ЗарегистрированныеАналоги, Истина);
	
	ЭтаФорма.ВсегоАналогов = ОтмеченныеАналоги.Количество();	
	
КонецПроцедуры

#КонецОбласти

#Область Поиск_аналогичных_ценных_бумаг

&НаСервере
Процедура ЗаполнитьАналоги()
	
	ЭтаФорма.Расшифровка.Очистить();
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("Операции", Новый Массив);
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							ЭтотОбъект.Организация);
	ПараметрыОценки.Вставить("Клиент",								ЭтотОбъект.Клиент);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости", ЭтотОбъект.Методика);
	
	// Получаем таблицу анализируемых ценных бумаг	
	
	ТаблицаЦБ = Новый ТаблицаЗначений;
	ТаблицаЦБ.Колонки.Добавить("ЦеннаяБумага",	Метаданные.РегистрыСведений.СтоимостьПереоценки.Измерения.ЦеннаяБумага.Тип);
	ТаблицаЦБ.Колонки.Добавить("Рынок", 		Метаданные.РегистрыСведений.СтоимостьПереоценки.Измерения.Рынок.Тип);
	ТаблицаЦБ.Колонки.Добавить("Биржа", 		Новый ОписаниеТипов("СправочникСсылка.Биржи"));
	
	СтрокаЦБ = ТаблицаЦБ.Добавить();
	СтрокаЦБ.ЦеннаяБумага	= ЭтотОбъект.ЦеннаяБумага;
	СтрокаЦБ.Рынок			= РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(ЭтотОбъект.ЦеннаяБумага);
	СтрокаЦБ.Биржа			= ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");	
		
	// Заполняем параметы поиска с учетом значений на форме
	
	ПараметрыПоиска = РаботаСПереоценкой.ПолучитьПараметрыПоискаАналогичныхБумаг(ПараметрыОценки, ЭтотОбъект.Период);
	
	Если ЭтаФорма.РедактированиеПараметров Тогда
		
		ПрефиксПараметраФормы		= "ПараметрПоиска";
		ПрефиксПараметровРейтинга	= "ПараметрыРасчетаРейтинга";
		
		Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
			
			Если СтрНачинаетсяС(РеквизитФормы.Имя, ПрефиксПараметраФормы) Тогда
				
				КлючПараметра		= Сред(РеквизитФормы.Имя, СтрДлина(ПрефиксПараметраФормы) + 1);
				ЗначениеПараметра	= ЭтаФорма[РеквизитФормы.Имя];
				
				Если СтрНачинаетсяС(КлючПараметра, ПрефиксПараметровРейтинга) Тогда
					
					КлючПараметра = Сред(РеквизитФормы.Имя, СтрДлина(ПрефиксПараметраФормы) + СтрДлина(ПрефиксПараметровРейтинга) + 1);
					
					Если КлючПараметра = "РейтинговаяГруппаГосударственныхОблигаций" И ЗначениеПараметра = 0 Тогда
						ЗначениеПараметра = Неопределено; // Этот параметр выбирается между НЕОПРЕДЕЛЕНО и 1, но для красоты вывел его на форму в виде флажка	
					КонецЕсли;
					
					Если Не ПараметрыПоиска.Свойство(ПрефиксПараметровРейтинга)
						ИЛИ ТипЗнч(ПараметрыПоиска[ПрефиксПараметровРейтинга]) <> Тип("Структура")
					Тогда
						ПараметрыПоиска.Вставить(ПрефиксПараметровРейтинга, Новый Структура);
					КонецЕсли;
					
					ПараметрыПоиска[ПрефиксПараметровРейтинга].Вставить(КлючПараметра, ЗначениеПараметра);
					
				Иначе
					
					ПараметрыПоиска.Вставить(КлючПараметра, ЗначениеПараметра);	
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;	
		
	КонецЕсли;
	
	ПараметрыПоиска.Вставить("РассчитыватьДюрациюПриОтсутствииДанныхММВБ", ЭтотОбъект.РассчитыватьДюрациюПриОтсутствииДанныхММВБ);
	
	// Выполняем поиск аналогов
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодобранныеАналоги = РаботаСПереоценкой.НайтиАналогичныеЦенныеБумаги(ТаблицаЦБ, ПараметрыОценки, ЭтотОбъект.Период, ПараметрыПоиска, МенеджерВременныхТаблиц, РасшифровкаРасчета); 
	
	ВсеНайденныеАналоги = МенеджерВременныхТаблиц.Таблицы["_НайденныеАналоги"].ПолучитьДанные().Выгрузить();
	
	ЭтаФорма.Аналоги.ЗагрузитьЗначения(ВсеНайденныеАналоги.ВыгрузитьКолонку("Аналог"));
	
	// Отметим необходимое число аналогов
	
	Если ПараметрыПоиска.Свойство("МинимальноеКоличествоАналогов") Тогда
		
		ЭтаФорма.Аналоги.ЗаполнитьПометки(Ложь);

		ВсегоАналогов = 0;
		
		// Отмечаем выбранные
		
		Если ЭтаФорма.ВыбранныеАналоги <> Неопределено Тогда
			
			Для Каждого ВыбранныйАналог Из ЭтаФорма.ВыбранныеАналоги Цикл
				СтрокаАналога = ЭтаФорма.Аналоги.НайтиПоЗначению(ВыбранныйАналог);
				Если СтрокаАналога <> Неопределено Тогда
					СтрокаАналога.Пометка = Истина;
					ВсегоАналогов = ВсегоАналогов + 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Дополняем новыми
		
		Для Каждого СтрокаАналога Из ПодобранныеАналоги Цикл
			Если ВсегоАналогов >= ПараметрыПоиска.МинимальноеКоличествоАналогов Тогда
				Прервать;
			КонецЕсли;
		
			ЭтаФорма.Аналоги.НайтиПоЗначению(СтрокаАналога.Аналог).Пометка = Истина;
			ВсегоАналогов = ВсегоАналогов + 1;
		КонецЦикла;
		
	Иначе
		
		ЭтаФорма.Аналоги.ЗаполнитьПометки(Истина);

	КонецЕсли;
	
	ПересчитатьИтогиПоАналогам(ЭтаФорма);	
	
	// Выводим расшифровку
	
	Если РасшифровкаРасчета.Операции.Количество() > 0 Тогда	
		
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("", , , ЭтаФорма.Расшифровка);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, Неопределено,			Новый Структура("ВыводитьВСвернутомВиде", "Истина"));
		РаботаСДокументами.УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, "Поиск аналогов",		Новый Структура("ВыводитьВСвернутомВиде", "Ложь"));
		РаботаСДокументами.УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, "ПараметрыЗапроса",		Новый Структура("ВыводитьВСвернутомВиде", "Ложь"));
		РаботаСДокументами.УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, "СегментыЦенныхБумаг",	Новый Структура("ВыводитьВСвернутомВиде", "Ложь"));
		РаботаСДокументами.УстановитьПараметрыРасшифровкиРезультатаОперации(РасшифровкаРасчета, "НайденныеАналоги",		Новый Структура("ВыводитьВСвернутомВиде", "Ложь"));
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДействующиеАналоги(ЦеннаяБумага, Клиент, Организация, Период)
	
	Запрос = Новый Запрос;
	
	РаботаСПереоценкой.ПоместитьАналогиЦенныхБумагВМенеджерВременныхТаблиц(Запрос, ЦеннаяБумага, Период, Организация, Клиент, , "_Аналоги"); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Аналоги.Аналог КАК Аналог
		|ИЗ
		|	_Аналоги КАК _Аналоги";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Аналог");	
	
КонецФункции

#КонецОбласти
